{
  "products": {
    "name": "The Overdue Life of Amy Byler - Kindle edition by Kelly Harms. Literature & Fiction Kindle eBooks @ Amazon.com.",
    "listPrice": null,
    "discription": "An Amazon Charts and Washington Post bestseller.“A laugh-out-loud funny, pitch-perfect novel that will have readers rooting for this unlikely, relatable, and totally lovable heroine, The Overdue Life of Amy Byler is the ultimate escape—and will leave moms everywhere questioning whether it isn’t time for a #momspringa of their own.” —New York Journal of BooksOverworked and underappreciated, single mom Amy Byler needs a break. So when the guilt-ridden husband who abandoned her shows up and offers to take care of their kids for the summer, she accepts his offer and escapes rural Pennsylvania for New York City.Usually grounded and mild mannered, Amy finally lets her hair down in the city that never sleeps. She discovers a life filled with culture, sophistication, and—with a little encouragement from her friends—a few blind dates. When one man in particular makes quick work of Amy’s heart, she risks losing herself completely in the unexpected escape, and as the summer comes to an end, Amy realizes too late that she must make an impossible decision: stay in this exciting new chapter of her life, or return to the life she left behind.But before she can choose, a crisis forces the two worlds together, and Amy must stare down a future where she could lose both sides of herself, and every dream she’s ever nurtured, in the beat of a heart.,An Amazon Charts and Washington Post bestseller.,“A laugh-out-loud funny, pitch-perfect novel that will have readers rooting for this unlikely, relatable, and totally lovable heroine, The Overdue Life of Amy Byler is the ultimate escape—and will leave moms everywhere questioning whether it isn’t time for a #momspringa of their own.” —New York Journal of Books,Overworked and underappreciated, single mom Amy Byler needs a break. So when the guilt-ridden husband who abandoned her shows up and offers to take care of their kids for the summer, she accepts his offer and escapes rural Pennsylvania for New York City.,Usually grounded and mild mannered, Amy finally lets her hair down in the city that never sleeps. She discovers a life filled with culture, sophistication, and—with a little encouragement from her friends—a few blind dates. When one man in particular makes quick work of Amy’s heart, she risks losing herself completely in the unexpected escape, and as the summer comes to an end, Amy realizes too late that she must make an impossible decision: stay in this exciting new chapter of her life, or return to the life she left behind.,But before she can choose, a crisis forces the two worlds together, and Amy must stare down a future where she could lose both sides of herself, and every dream she’s ever nurtured, in the beat of a heart.",
    "product_dimension": null,
    "imageURLs": "https://images-na.ssl-images-amazon.com/images/I/51CUy6NuYSL.jpg",
    "weight": null,
    "sourceURL": "https://www.amazon.com/gp/product/B07GVK5HW8/ref=s9_acsd_ri_bw_c_x_7_w?pf_rd_m=ATVPDKIKX0DER&pf_rd_s=merchandised-search-10&pf_rd_r=TNH250R6Y1W1TJC4PV4Q&pf_rd_t=101&pf_rd_p=b34f3048-7fa4-49b0-99af-8102f019a6c3&pf_rd_i=283155"
  }
}