{
  "products": {
    "name": "Amazon.com: Harry Potter and the Sorcerer's Stone eBook: J.K. Rowling, Mary GrandPré: Kindle Store",
    "listPrice": null,
    "discription": "\"Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger and a snake surrounding a large letter 'H'.\"Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!Harry Potter and the Sorcerer’s Stone is also available as an Illustrated Kindle-in-Motion edition.,\"Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger and a snake surrounding a large letter 'H'.\"Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!,Harry Potter and the Sorcerer’s Stone is also available as an Illustrated Kindle-in-Motion edition.,",
    "product_dimension": null,
    "imageURLs": "https://images-na.ssl-images-amazon.com/images/I/41lnLrvBnML.jpg",
    "weight": null,
    "sourceURL": "https://www.amazon.com/gp/product/B0192CTMYG/ref=s9_acsd_ri_bw_c_x_8_w?pf_rd_m=ATVPDKIKX0DER&pf_rd_s=merchandised-search-10&pf_rd_r=2KC3DG7QT67TMV7G8RSB&pf_rd_t=101&pf_rd_p=b34f3048-7fa4-49b0-99af-8102f019a6c3&pf_rd_i=283155"
  }
}