{
  "products": {
    "name": "Thin Air (Jessica Shaw Book 1) - Kindle edition by Lisa Gray. Mystery, Thriller & Suspense Kindle eBooks @ Amazon.com.",
    "listPrice": null,
    "discription": "A Washington Post, Wall Street Journal, and Amazon Charts bestseller.“Lisa Gray explodes onto the literary stage with this taut, edge-of-the-seat thriller, and her headstrong protagonist, Jessica Shaw, reminiscent of Lee Child’s Jack Reacher, delivers a serious punch.” —Robert Dugoni, New York Times bestselling authorPrivate investigator Jessica Shaw is used to getting anonymous tips. But after receiving a photo of a three-year-old kidnapped from Los Angeles twenty-five years ago, Jessica is stunned to recognize the little girl as herself.Eager for answers, Jessica heads to LA’s dark underbelly. When she learns that her biological mother was killed the night she was abducted, Jessica’s determined to solve a case the police have forgotten. Meanwhile, veteran LAPD detective Jason Pryce is in the midst of a gruesome investigation into a murdered college student moonlighting as a prostitute. A chance encounter leads to them crossing paths, but Jessica soon realizes that Pryce is hiding something about her father’s checkered history and her mother’s death.To solve her mother’s murder and her own disappearance, Jessica must dig into the past and find the secrets buried there. But the air gets thinner as she crawls closer to the truth, and it’s getting harder and harder to breathe.,A Washington Post, Wall Street Journal, and Amazon Charts bestseller.,“Lisa Gray explodes onto the literary stage with this taut, edge-of-the-seat thriller, and her headstrong protagonist, Jessica Shaw, reminiscent of Lee Child’s Jack Reacher, delivers a serious punch.” —Robert Dugoni, New York Times bestselling author,Private investigator Jessica Shaw is used to getting anonymous tips. But after receiving a photo of a three-year-old kidnapped from Los Angeles twenty-five years ago, Jessica is stunned to recognize the little girl as herself.,Eager for answers, Jessica heads to LA’s dark underbelly. When she learns that her biological mother was killed the night she was abducted, Jessica’s determined to solve a case the police have forgotten. Meanwhile, veteran LAPD detective Jason Pryce is in the midst of a gruesome investigation into a murdered college student moonlighting as a prostitute. A chance encounter leads to them crossing paths, but Jessica soon realizes that Pryce is hiding something about her father’s checkered history and her mother’s death.,To solve her mother’s murder and her own disappearance, Jessica must dig into the past and find the secrets buried there. But the air gets thinner as she crawls closer to the truth, and it’s getting harder and harder to breathe.",
    "product_dimension": null,
    "imageURLs": "https://images-na.ssl-images-amazon.com/images/I/41loP-2eVzL.jpg",
    "weight": null,
    "sourceURL": "https://www.amazon.com/gp/product/B07G8NTJVP/ref=s9_acsd_ri_bw_c_x_14_w?pf_rd_m=ATVPDKIKX0DER&pf_rd_s=merchandised-search-10&pf_rd_r=2KC3DG7QT67TMV7G8RSB&pf_rd_t=101&pf_rd_p=b34f3048-7fa4-49b0-99af-8102f019a6c3&pf_rd_i=283155"
  }
}