[
    {
        "name": "Kitchen Confidential Updated Edition: Adventures in the Culinary Underbelly (P.S.)",
        "listPrice": 6.41,
        "description": "A deliciously funny, delectably shocking banquet of wild-but-true tales of life in the culinary trade from Chef Anthony Bourdain, laying out his more than a quarter-century of drugs, sex, and haute cuisine&mdash;now with all-new, never-before-published material.",
        "dimensions": "5.3 x 0.8 x 8 inches",
        "weight": " 14.4 ounces ",
        "imageURL": "https://images-na.ssl-images-amazon.com/images/I/51lKkGeCI4L._SX326_BO1,204,203,200_.jpg",
        "sourceURL": "https://www.amazon.com/Kitchen-Confidential-Updated-Adventures-Underbelly/dp/0060899220/ref=sr_1_1?s=books&ie=UTF8&qid=1532148528&sr=1-1&refinements=p_n_feature_browse-bin%3A2656022011",
        "id": 1
    },
    {
        "name": "Fahrenheit 451",
        "listPrice": 8.99,
        "description": "Ray Bradbury&#8217;s internationally acclaimed novel Fahrenheit 451 is a masterwork of twentieth-century literature set in a bleak, dystopian future.Guy Montag is a fireman. In his world, where television rules and literature is on the brink of extinction, firemen start fires rather than put them out. His job is to destroy the most illegal of commodities, the printed book, along with the houses in which they are hidden.Montag never questions the destruction and ruin his actions produce, returning each day to his bland life and wife, Mildred, who spends all day with her television &#8220;family.&#8221; But then he meets an eccentric young neighbor, Clarisse, who introduces him to a past where people didn&#8217;t live in fear and to a present where one sees the world through the ideas in books instead of the mindless chatter of television.When Mildred attempts suicide and Clarisse suddenly disappears, Montag begins to question everything he has ever known. He starts hiding books in his home, and when his pilfering is discovered, the fireman has to run for his life.",
        "dimensions": "5.5 x 0.9 x 8.4 inches",
        "weight": " 6.2 ounces ",
        "imageURL": "https://images-na.ssl-images-amazon.com/images/I/41qI9quGIdL._SX324_BO1,204,203,200_.jpg",
        "sourceURL": "https://www.amazon.com/Fahrenheit-451-Ray-Bradbury/dp/1451673310/ref=sr_1_2?s=books&ie=UTF8&qid=1532148528&sr=1-2&refinements=p_n_feature_browse-bin%3A2656022011&smid=ATVPDKIKX0DER",
        "id": 2
    },
    {
        "name": "The Handmaid's Tale",
        "listPrice": 9.57,
        "description": "From the bestselling author of Alias Grace and the MaddAddam trilogy, here is the #1 New York Times bestseller and seminal work of speculative fiction from the Booker Prize-winning author.Now a Hulu series starring Elizabeth Moss, Samira Wiley, and Joseph Fiennes. Includes a new introduction by Margaret Atwood.Nominated as one of America&rsquo;s best-loved novels by PBS&rsquo;s The Great American Read Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Handmaids are valued only if their ovaries are viable. Offred can remember the days before, when she lived and made love with her husband Luke; when she played with and protected her daughter; when she had a job, money of her own, and access to knowledge. But all of that is gone now&hellip;. Funny, unexpected, horrifying, and altogether convincing,&#160;The Handmaid's Tale&#160;is at once scathing satire, dire warning, and literary tour de force.",
        "dimensions": "5.2 x 0.7 x 8 inches",
        "weight": " 4.8 ounces ",
        "imageURL": "https://images-na.ssl-images-amazon.com/images/I/518GwHMsHcL._SX322_BO1,204,203,200_.jpg",
        "sourceURL": "https://www.amazon.com/Handmaids-Tale-Margaret-Atwood/dp/038549081X/ref=sr_1_3?s=books&ie=UTF8&qid=1532148528&sr=1-3&refinements=p_n_feature_browse-bin%3A2656022011&smid=ATVPDKIKX0DER",
        "id": 3
    },
    {
        "name": "The Great Gatsby",
        "listPrice": 8.99,
        "description": "A true classic of twentieth-century literature, this edition has been updated by Fitzgerald scholar James L.W. West III to include the author&rsquo;s final revisions and features a note on the composition and text, a personal foreword by Fitzgerald&rsquo;s granddaughter, Eleanor Lanahan&mdash;and a new introduction by two-time National Book Award winner Jesmyn Ward.The Great Gatsby, F. Scott Fitzgerald&rsquo;s third book, stands as the supreme achievement of his career. First published in 1925, this quintessential novel of the Jazz Age has been acclaimed by generations of readers. The story of the mysteriously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted &ldquo;gin was the national drink and sex the national obsession,&rdquo; it is an exquisitely crafted tale of America in the 1920s.",
        "dimensions": "5.2 x 0.5 x 8 inches",
        "weight": " 5.6 ounces ",
        "imageURL": "https://images-na.ssl-images-amazon.com/images/I/51vv75oglyL._SX326_BO1,204,203,200_.jpg",
        "sourceURL": "https://www.amazon.com/Great-Gatsby-F-Scott-Fitzgerald/dp/0743273567/ref=sr_1_4?s=books&ie=UTF8&qid=1532148528&sr=1-4&refinements=p_n_feature_browse-bin%3A2656022011&smid=ATVPDKIKX0DER",
        "id": 4
    },
    {
        "name": "1984 (Signet Classics)",
        "listPrice": 5.59,
        "description": "Written in 1948, 1984 was George Orwell&rsquo;s chilling prophecy about the future. And while 1984 has come and gone, his dystopian vision of a government that will do anything to control the narrative is timelier than ever...&bull;Nominated as one of America&rsquo;s best-loved novels by PBS&rsquo;s The Great American Read&bull;&ldquo;The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.&rdquo;Winston Smith toes the Party line, rewriting history to satisfy the demands of the Ministry of Truth. With each lie he writes, Winston grows to hate the Party that seeks power for its own sake and persecutes those who dare to commit thoughtcrimes. But as he starts to think for himself, Winston can&rsquo;t escape the fact that Big Brother is always watching...A&#160;startling and haunting vision of the world, 1984 is&#160;so powerful that it is completely convincing from start to finish. No one can deny the influence of this novel, its hold on the imaginations of multiple generations of readers, or the resiliency of its admonitions&mdash;a legacy that seems only to grow with the passage of time.",
        "dimensions": "4.2 x 1 x 7.5 inches",
        "weight": " 8.5 ounces ",
        "imageURL": "https://images-na.ssl-images-amazon.com/images/I/31lWUHDG7uL._SX282_BO1,204,203,200_.jpg",
        "sourceURL": "https://www.amazon.com/1984-Signet-Classics-George-Orwell/dp/0451524934/ref=sr_1_5?s=books&ie=UTF8&qid=1532148528&sr=1-5&refinements=p_n_feature_browse-bin%3A2656022011&smid=ATVPDKIKX0DER",
        "id": 5
    },
    {
        "name": "The Book Thief",
        "listPrice": 11.64,
        "description": "DON&rsquo;T MISS BRIDGE OF CLAY, MARKUS ZUSAK&rsquo;S FIRST NOVEL SINCE THE BOOK THIEF. &#160;The extraordinary #1&#160;New York Times&#160;bestseller that is now a major motion picture, Markus Zusak's unforgettable story is about the ability of books to feed the soul. &#160; When Death has a story to tell, you listen. It is 1939. Nazi Germany. The country is holding its breath. Death has never been busier, and will become busier still. Liesel Meminger is a foster girl living outside of Munich, who scratches out a meager existence for herself by stealing when she encounters something she can&rsquo;t resist&ndash;books. With the help of her accordion-playing foster father, she learns to read and shares her stolen books with her neighbors during bombing raids as well as with the Jewish man hidden in her basement.&#160; In superbly crafted writing that burns with intensity, award-winning author Markus Zusak, author of&#160;I Am the Messenger,&#160;has given us one of the most enduring stories of our time. &#160; &ldquo;The kind of book that can be life-changing.&rdquo; &mdash;The New York Times &#160; &ldquo;Deserves a place on the same shelf with The Diary of a Young Girl by Anne Frank.&rdquo; &mdash;USA Today",
        "dimensions": "5.2 x 1.2 x 8 inches",
        "weight": " 15.2 ounces ",
        "imageURL": "https://images-na.ssl-images-amazon.com/images/I/51dEuPZMS-L._SX322_BO1,204,203,200_.jpg",
        "sourceURL": "https://www.amazon.com/Book-Thief-Markus-Zusak/dp/0375842209/ref=sr_1_6?s=books&ie=UTF8&qid=1532148528&sr=1-6&refinements=p_n_feature_browse-bin%3A2656022011&smid=ATVPDKIKX0DER",
        "id": 6
    },
    {
        "name": "The Things They Carried",
        "listPrice": 10.97,
        "description": "A classic work of American literature that has not stopped changing minds and lives since it burst onto the literary scene, The Things They Carried is a ground-breaking meditation on war, memory, imagination, and the redemptive power of storytelling.&#160; &#160;The Things They Carried depicts the men of Alpha Company: Jimmy Cross, Henry Dobbins, Rat Kiley, Mitchell Sanders, Norman Bowker, Kiowa, and the character Tim O&#8217;Brien, who has survived his tour in Vietnam to become a father and writer at the age of forty-three. &#160;Taught everywhere&#151;from high school classrooms to graduate seminars in creative writing&#151;it has become required reading for any American and continues to challenge readers in their perceptions of fact and fiction, war and peace, courage and fear and longing.",
        "dimensions": "5.3 x 0.6 x 8 inches",
        "weight": " 7.2 ounces ",
        "imageURL": "https://images-na.ssl-images-amazon.com/images/I/51f1X0WUPqL._SX330_BO1,204,203,200_.jpg",
        "sourceURL": "https://www.amazon.com/Things-They-Carried-Tim-OBrien/dp/0618706410/ref=sr_1_7?s=books&ie=UTF8&qid=1532148528&sr=1-7&refinements=p_n_feature_browse-bin%3A2656022011&smid=ATVPDKIKX0DER",
        "id": 7
    },
    {
        "name": "Things Fall Apart",
        "listPrice": 9.99,
        "description": "&ldquo;A true classic of world literature . . . A masterpiece that has inspired generations of writers in Nigeria, across Africa, and around the world.&rdquo;&#160; &mdash;Barack Obama&#160;Nominated as one of America&rsquo;s best-loved novels by PBS&rsquo;s The Great American ReadThings Fall Apart is the first of three novels in Chinua Achebe's critically acclaimed African Trilogy. It is a classic narrative about Africa's cataclysmic encounter with Europe as it establishes a colonial presence on the continent. Told through the fictional experiences of Okonkwo, a wealthy and fearless Igbo warrior of Umuofia in the late 1800s, Things Fall Apart explores one man's futile resistance to the devaluing of his Igbo traditions by British political andreligious forces and his despair as his community capitulates to the powerful new order. With more than 20 million copies sold and translated into fifty-seven languages, Things Fall Apart provides one of the most illuminating and permanent monuments to African experience. Achebe does not only capture life in a pre-colonial African village, he conveys the tragedy of the loss of that world while broadening our understanding of our contemporary realities.",
        "dimensions": "5.2 x 0.6 x 8 inches",
        "weight": " 6.4 ounces ",
        "imageURL": "https://images-na.ssl-images-amazon.com/images/I/61l%2BVmohEOL._SX322_BO1,204,203,200_.jpg",
        "sourceURL": "https://www.amazon.com/Things-Fall-Apart-Chinua-Achebe/dp/0385474547/ref=sr_1_8?s=books&ie=UTF8&qid=1532148528&sr=1-8&refinements=p_n_feature_browse-bin%3A2656022011&smid=ATVPDKIKX0DER",
        "id": 8
    },
    {
        "name": "The Lightning Thief (Percy Jackson and the Olympians, Book 1)",
        "listPrice": 5.08,
        "description": "Percy Jackson and the Olympians, Book One: Lightning Thief, The",
        "dimensions": "5.2 x 1 x 7.6 inches",
        "weight": " 7.2 ounces ",
        "imageURL": "https://images-na.ssl-images-amazon.com/images/I/51BfYSYSfxL._SX336_BO1,204,203,200_.jpg",
        "sourceURL": "https://www.amazon.com/Lightning-Thief-Percy-Jackson-Olympians/dp/0786838655/ref=sr_1_9?s=books&ie=UTF8&qid=1532148528&sr=1-9&refinements=p_n_feature_browse-bin%3A2656022011&smid=ATVPDKIKX0DER",
        "id": 9
    },
    {
        "name": "In Cold Blood",
        "listPrice": 12.8,
        "description": "National Bestseller&#160;On November 15, 1959, in the small town of Holcomb, Kansas, four members of the Clutter family were savagely murdered by blasts from a shotgun held a few inches from their faces. There was no apparent motive for the crime, and there were almost no clues.&#160;As Truman Capote reconstructs the murder and the investigation that led to the capture, trial, and execution of the killers, he generates both mesmerizing suspense and astonishing empathy. In Cold Blood is a work that transcends its moment, yielding poignant insights into the nature of American violence.",
        "dimensions": "5.2 x 0.7 x 8 inches",
        "weight": " 1.3 pounds ",
        "imageURL": "https://images-na.ssl-images-amazon.com/images/I/41GpHh-5KFL._SX322_BO1,204,203,200_.jpg",
        "sourceURL": "https://www.amazon.com/Cold-Blood-Truman-Capote/dp/0679745580/ref=sr_1_10?s=books&ie=UTF8&qid=1532148528&sr=1-10&refinements=p_n_feature_browse-bin%3A2656022011",
        "id": 10
    }
]