AllMyBooksArePacked/book_packer_api/app/controllers/boxes_controller.rb

SELECT "boxes".* FROM "boxes"
---
  def index
    @boxes = Box.all